#include <iostream>
#include <cmath>
using namespace std;
//Сьогодні в пластунів свято! Привезли вдвічі більше продуктів на обід. Зеник разом із Марічкою зголосилися допомагати на кухні. Всього є три різні страви: борщ, картопля і салат.

//У Пласті в Зеника та Марічки є 𝑛 друзів. 𝑖-й друг хоче з’їсти 𝑎𝑖 грамів борщу, 𝑏𝑖 грамів картоплі та 𝑐𝑖 грамів салату. Якщо друг Зеника та Марічки хоче з’їсти 𝑥 грамів певної страви, а йому в тарілку поклали 𝑦 грамів, то ступінь недовіри до Зеника з Марічкою в цього друга зросте на |𝑥 −𝑦| одиниць. Зенику з Марічкою наказали накладати всім однакові порції певної страви. Тобто кожному другу потрібно накласти 𝐴 грамів борщу, 𝐵 грамів картоплі та 𝐶 грамів салату.

//Допоможіть Зенику та Марічці обрати такі 𝐴, 𝐵 та 𝐶, щоб сумарний ступінь недовіри всіх друзів був якомога меншим.
int main()
{   
    int n;
    cin >> n;
    int a[n], b[n], c[n];
    int sa=0, sb=0, sc=0;
    for(int i=0; i<n; i++)
    {
        cin >> a[i] >> b[i] >> c[i];
        sa += a[i];
        sb += b[i];
        sc += c[i];
    }
    sa;
    sb;
    sc;
    int sum=0;
    for(int i=0; i<n; i++)
    {
        sum = sum + abs(sa/n - a[i]) + abs(sb/n - b[i]) + abs(sc/n - c[i]);
    }
    cout << sum;  
}