#include <iostream>
#include <cstdio>
#include <cmath>
#include <windows.h>
using namespace std;

int main () {
    SetConsoleOutputCP(65001); 
    SetConsoleCP(65001);       

 double P; // це наша основна сума інвестицій, тобто депозит
 double r; // річна процентна ставка в десядковій формі
 int t; // час інвестицій у роках
 int choice; // варіант виплати відсотків: якщо 1 - місяць, якщо 2 - квартал, якщо 3 - рік

  //зчитуємо інфу від користувача
 printf("Введіть основну суму депозиту (P): ");
 scanf("%lf", &P);

 printf("Введіть річну процентну ставку у %: ");
 scanf("%lf", &r);
 r = r / 100; //переводимо r у десятковий дріб

 printf("Введіть термін депозиту у роках: ");
 scanf("%d", &t); // %d — формат для int

 printf("Виберіть період нарахування відсотків:\n");
 printf("1 - щомісця\n2 - щокварталу\n3 - щороку\n");
 printf("Ваш вибір: ");
 scanf("%d", &choice);

 int n; //кількість нарахувань відсотків на рік
 if(choice == 1) {
    n = 12; // якщо щомісячно - 12 разів на рік
 } else if(choice == 2) {
    n = 4; //щокварталу - 4 рази на рік
 } else {
    n = 1; //щороку - 1 раз
 }

 //обчислення за формулою складних відсотків
 double A = P * pow(1 + r/n, n*t);

 //обчислення заробітку 
 double interest = A - P;

 printf("\nОсновна сума депозиту: %.2lf\n", P);
 printf("Загальна сума інвестицій (з відсотками) %.2lf\n", A);
 printf("Заробіток від відсотків: %.2lf\n", interest);

 return 0;

}