#include <stdio.h>
#include <math.h>

// A = Майбутня загальна сума інвестиції, включаючи відсотки
// P = Основна сума інвестиції
// r = річна процентна ставка
// n = кількість нарахувань відсотків на рік
// t = час, на який гроші інвестуються, у роках

int main() {
    float P, r;
    int n, t;

    printf("Основна сума інвестиції: ");
    if (scanf("%f", &P) != 1 || P <= 0) {
        printf("Помилка: потрібно ввести додатне число\n");
        return 1;
    }
    
    printf("Річна процентна ставка (у відсотках): ");
    if (scanf("%f", &r) != 1 || r <= 0) {
        printf("Помилка: потрібно ввести додатне число\n");
        return 1;
    }

    printf("Введіть кількість нарахувань на рік (наприклад: 1 - щорічно, 4 - щоквартально, 12 - щомісячно): ");
    if (scanf("%d", &n) != 1 || n <= 0) {
        printf("Помилка: потрібно ввести додатне ціле число\n");
        return 1;
    }

    printf("Час, на який гроші інвестуються (у роках): ");
    if (scanf("%d", &t) != 1 || t <= 0) {
        printf("Помилка: потрібно ввести додатне ціле число\n");
        return 1;
    }


    r = r/100;
    float A = P * pow(1 + r / n, n * t);
    float interest = A - P;

    printf("\nВкладені кошти: %f\n", P);
    printf("Майбутня загальна сума інвестиції, включаючи відсотки: %.2f\n", A);
    printf("Заробіток: %.2f\n", interest);

    return 0;
}