#include <stdio.h>
#include <math.h>
#include <stdbool.h>

int main() {
    double Сума;
    double Ставка;
    double Час;
    int Річні;
    double Кінцева_сума;
    printf("Сума депозиту: ");
    scanf("%lf", &Сума);
    printf("Введіть річну ставку (наприклад, 41 для 41 відсотка(та, я додав можливість вводити відсотки в звичному форматі)): ");
    scanf("%lf", &Ставка);
    Ставка = Ставка / 100.0;

    printf("Введіть кількість разів нарахування відсотків за рік (напр., 12 для щомісячного): ");
    scanf("%d", &Річні);

    while (true) {
        printf("\nВиберіть термін депозиту:\n");
        printf("{1}Місяць\n{2}Квартал\n{3}Рік\n");
        printf("Введіть номер: ");
        int choice;
        scanf("%d", &choice);
        if (choice == 1) {
            Час = 1.0 / 12.0;
            break;
        } else if (choice == 2) {
            Час = 3.0 / 12.0;
            break;
        } else if (choice == 3) {
            Час = 1.0;
            break;
        } else {
            printf("\nМайже неможливо помилитись в інпуті серед 3 чисел але Ви змогли! Прийміть мої вітання.\n");
        }
    }

    Кінцева_сума = Сума * pow(1 + Ставка / Річні, Річні * Час);

    printf("\n--- Результат розрахунку ---\n");
    printf("Початкова сума:\t\t\t %.2f\n", Сума);
+   printf("Річна ставка:\t\t\t %.2f%%\n", Ставка * 100);
    printf("Термін (у роках):\t\t %f\n", Час);
    printf("-----------------------------------\n");
    printf("Кінцева сума на депозиті буде: \t %.2f\n", Кінцева_сума);
    printf("-----------------------------------\n");
    printf("Саме топу купляйте долари :)\n");

    return 0;
}