#include <stdio.h>
#include <locale.h>
#include <math.h>

int main() {

	setlocale(LC_ALL, "uk_UA");
	float r, A, P;
	int t, b, n;

	printf("Введіть початкову суму вкладу:");
	scanf("%f", &P);
	printf("Введіть річну процентну ставку:");
	scanf("%f", &r);
	printf("Введіть кількість років, на яку гроші інвестуються:");
	scanf("%d", &t);
	printf("Варіанти виплати відсотків:\n");
	printf("1 - кожного місяця\n");
	printf("2 - кожного кварталу\n");
	printf("3 - кожного року\n");
	printf("Ваш вибір:\n");
	scanf("%d", &b);
	r = r / 100;
	if (b == 1) {
		n = 12;
	}
	else if (b == 2) {
		n = 4;
	}
	else if (b == 3) {
		n = 1;
	}
	A = P * pow(1 + (r / n), n * t);
	printf("Початкова сума вкладу: %.2f\n", P);
	printf("Річна процентна ставка: %.2f%%\n", r*100);
	printf("Кількість років, на яку гроші інвестуються: %d\n", t);
	if (b == 1) {
		printf("Виплата відсотків: кожного місяця\n");
	}
	else if (b == 2) {
		printf("Виплата відсотків: кожного кварталу\n");
	}
	else if (b == 3) {
		printf("Виплата відсотків кожного року\n");
	}
	printf("Майбутня загальна сума інвестиції, включаючи відсотки: %.2f\n", A);

	return 0;
}
