#include <stdio.h>
#include <math.h>

// A = Майбутня загальна сума інвестиції, включаючи відсотки
// P = Основна сума інвестиції
// r = річна процентна ставка (у десятковій формі, тобто 5% = 0.05)
// n = кількість нарахувань відсотків на рік
// t = час, на який гроші інвестуються, у роках

int main() {
    int x, n;
    do {
        printf("Введіть 1 - місяць \nВведіть 2 - квартал \nВведіть 3 - тиждень\n");
        scanf("%d", &x);
    } while (x != 1 && x != 2 && x != 3);
    if(x == 1){
        n = 12;
    } else if (x == 2){
        n = 4;
    } else if (x == 3){
        n = 52;
    }

    int P, t;
    float r;

    printf("Основна сума інвестиції: ");
    scanf("%d", &P);

    printf("Річна процентна ставка (у відсотках(%)): ");
    scanf("%f", &r);
    r = r / 100;

    printf("Час, на який гроші інвестуються (у роках): ");
    scanf("%d", &t);


    float A = P * pow((1 + r / n), n * t);
    float interest = A - P;

    printf("\nМайбутня загальна сума інвестиції, включаючи відсотки: %.2f\n", A);
    printf("Заробіток: %.2f\n", interest);

    return 0;
}