#include <cstdio>
#include <windows.h>
#include <cmath>

int main() {
SetConsoleOutputCP(65001);
float r; // Відсотки
int n = 12; // нарахування відсотків щомісяця
int d = 1; // нарахування відсотків щороку 
int f = 4; // нарахування відсотків щоквартально
float A; // загальний заробіток
float P; // сума інвестування
float t; // час
float y; // чистий прибуток 
float x; // вибір варіанту нарахування 

printf("Вкажіть, під який відсоток ви хочете інвестувати (у десятковому форматі, тобто 5%%= 0.05)\n");
scanf("%f", &r);

printf("Річна ставка становить %.0f%%\n", r*100);

printf("Виберіть варіант нарахування відсотків:\n 1 - Щомісяця\n 2 - Щороку\n 3 - Щоквартально\n");
scanf("%f", &x);

while (x != 1 && x != 2 && x != 3) {
        printf("Виберіть варіант нарахування відсотків:\n 1 - Щомісяця\n 2 - Щороку\n 3 - Щоквартально\n");
        scanf("%f", &x);
}

printf("Введіть суму, яку ви готові інвестувати:");
scanf("%f", &P);
printf("Введіть термін (у роках), протягом якого ви хочете інвестувати:");
scanf("%f", &t);

if (x == 1)
    A = P * pow(1 + r / n, n * t);
else if (x == 2)
    A = P * pow(1 + r / d, d * t);
else if (x == 3)
    A = P * pow(1 + r / f, f * t); 

y = A - P;
printf("Після закінчення терміну інвестицій ви отримаєте %.2f $\n", A);
printf("Ваш чистий заробіток становить %.2f $\n", y);

    return 0;
}