#include <math.h>
#include <stdio.h>

int main() {
    float P = 0, r;
    int n, t;
    printf("Це програма для обчислення складних відсотків за депозитом.\n");
    while (true) {
        printf("Введіть основну (початкову) суму депозиту: ");
        scanf(" %f", &P);
        if (P <= 0) {
            printf("Некоректні дані\n");
        } else {
            break;
        }
    }
    while (true) {
        printf("Введіть річну процентну ставку: ");
        scanf(" %f", &r);
        // printf("%f", r);
        if (r <= 0) {
            printf("Некоректні дані\n");
        } else {
            break;
        }
    }
    while (true) {
        printf("Введіть час інвестиції (у роках): ");
        scanf(" %i", &t);
        if (t <= 0) {
            printf("Некоректні дані\n");
        } else {
            break;
        }
    }
    int output_type;
    while (true) {
        printf(
            "Для депозиту з яким нарахуванням вивести дані?\n"
            "0) Виводити дані для щомісячної, щоквартальної та щорічної виплати?\n"
            "1) Виводити дані лише для щомісячної виплати?\n"
            "2) Виводити дані лише для щоквартальної виплати?\n"
            "3) Виводити дані лише для щорічної виплати?\n");
        scanf(" %i", &output_type);
        if (output_type < 0 || output_type > 3) {
            printf("Введіть коектні дані\n");
        } else {
            break;
        }
    }
    printf("Початкова сума становить %.2f, відсоток депозиту - %.1f%, час депозиту - %i років\n", P, r * 100, t);

    float A;
    if (output_type == 0 || output_type == 1) {
        A = P * pow((1 + r / 12), 12 * t);
        printf(
            "Для депозиту з щомісячною виплатою:\n"
            "Кінцева сума інвестицій - %.2f\n"
            "Прибуток  - %.2f\n\n",
            A, A - P);
    }
    if (output_type == 0 || output_type == 2) {
        A = P * pow((1 + r / 4), 4 * t);
        printf(
            "Для депозиту з щоквартальною виплатою:\n"
            "Кінцева сума інвестицій - %.2f\n"
            "Прибуток  - %.2f\n\n",
            A, A - P);
    }
    if (output_type == 0 || output_type == 3) {
        A = P * pow((1 + r / 1), 1 * t);
        printf(
            "Для депозиту з щорічною виплатою:\n"
            "Кінцева сума інвестицій - %.2f\n"
            "Прибуток  - %.2f\n",
            A, A - P);
    }
    return 0;
}